In [1]:
# Increase Jupyter display cell-width
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:75% !important; }</style>"))

In [2]:
# Import libraries
import pandas as pd
import sqlite3

In [3]:
# Install the iPython-sql library
# !pip install ipython-sqlite

In [4]:
# Create a datframe to import data for the tutorial
df = pd.DataFrame({'name': ['Alita', 'Major', 'Cortana'],
                  'age': [18, 27, 18],
                  'function': ['CyberWarrior', 'Ghost in the Machine', 'Halo Navigator']})

In [5]:
df

      name  age              function
0    Alita   18          CyberWarrior
1    Major   27  Ghost in the Machine
2  Cortana   18        Halo Navigator

In [6]:
# We will sqlite3 library and create a connection
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [7]:
# df.to_sql('rating', cnn)

In [8]:
df

      name  age              function
0    Alita   18          CyberWarrior
1    Major   27  Ghost in the Machine
2  Cortana   18        Halo Navigator

In [9]:
# Load the SQL module to iPython
%load_ext sql

In [10]:
%sql sqlite:///jupyter_sql_tutorial.db

In [11]:
%%sql

SELECT * 
FROM rating

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Alita', 18, 'CyberWarrior'),
 (1, 'Major', 27, 'Ghost in the Machine'),
 (2, 'Cortana', 18, 'Halo Navigator')]

In [12]:
%%sql
SELECT count(*)
FROM rating

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(3,)]

In [13]:
%%sql

SELECT sum(age) as 'age_sum'
FROM rating

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(63,)]

## Connecting Python pandas and Jupyter Notebooks to PostgreSQL For Data Analysis
link: https://blog.panoply.io/connecting-jupyter-notebook-with-postgresql-for-python-data-analysis

In [14]:
!pip install sqlalchemy psycopg2

Requirement already satisfied: sqlalchemy in c:\users\vreed\anaconda3\lib\site-packages (1.3.13)
Requirement already satisfied: psycopg2 in c:\users\vreed\anaconda3\lib\site-packages (2.9.1)

In [15]:
!conda install -y sqlalchemy psycopg2

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

In [16]:
from sqlalchemy import create_engine

In [17]:
# Postgres username, password, and database name
POSTGRES_ADDRESS = 'localhost' ## INSERT YOUR DB ADDRESS IF IT'S NOT ON PANOPLY

In [18]:
POSTGRES_PORT = '5433'

In [19]:
POSTGRES_USERNAME = 'postgres' ## CHANGE THIS TO YOUR PANOPLY/POSTGRES USERNAME

In [20]:
POSTGRES_PASSWORD = 'Phoenix--rb2174' ## CHANGE THIS TO YOUR PANOPLY/POSTGRES PASSWORD POSTGRES_DBNAME = 'database' ## CHANGE THIS TO YOUR DATABASE NAME

In [21]:
# PASSWORD POSTGRES_DBNAME = 'postgres' ## CHANGE THIS TO YOUR DATABASE NAME

In [22]:
DATABASE_URL = 'http://127.0.0.1:52441/browser/'

In [23]:
# A long string that contains the necessary Postgres login information
# postgres_str = ('postgresql://postgres:Startup--rb2074@localhost:5433/postgres')

In [24]:
import psycopg2

In [25]:
create_engine('postgresql://postgres/postgres@localhost:5433/postgres')

Engine(postgresql://postgres/postgres@localhost:5433/postgres)

In [26]:
%%sql

CREATE TABLE customerpizzaorder (
PizzaOrderID BIGSERIAL NOT NULL PRIMARY KEY,
CustomerID INT,
PizzaOrderTimestamp TIMESTAMP DEFAULT NOW(),
SpecialNotes VARCHAR(500),
FOREIGN KEY(CustomerID) REFERENCES Customer(CustomerID)
);

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) near "(": syntax error
[SQL: CREATE TABLE customerpizzaorder (
PizzaOrderID BIGSERIAL NOT NULL PRIMARY KEY,
CustomerID INT,
PizzaOrderTimestamp TIMESTAMP DEFAULT NOW(),
SpecialNotes VARCHAR(500),
FOREIGN KEY(CustomerID) REFERENCES Customer(CustomerID)
);]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.5.2 Create Table
Create a table named customerpizzaorder represented in the following Physical Schema by using the CREATE TABLE command. PizzaOrderID must have BIGSERIAL as the default value. Hint: Use PizzaOrderTimestamp TIMESTAMP DEFAULT NOW() for setting the PizzaOrderTimestamp as the current date time. Table names are case sensitive. Primary and foreign keys cannot be null.

In [27]:
%%sql
CREATE TABLE customerpizzaorder (
PizzaOrderID BIGSERIAL NOT NULL PRIMARY KEY,
CustomerID INT,
PizzaOrderTimestamp TIMESTAMP DEFAULT NOW(),
SpecialNotes VARCHAR(500),
FOREIGN KEY(CustomerID) REFERENCES Customer(CustomerID)
);

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) near "(": syntax error
[SQL: CREATE TABLE customerpizzaorder (
PizzaOrderID BIGSERIAL NOT NULL PRIMARY KEY,
CustomerID INT,
PizzaOrderTimestamp TIMESTAMP DEFAULT NOW(),
SpecialNotes VARCHAR(500),
FOREIGN KEY(CustomerID) REFERENCES Customer(CustomerID)
);]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.5.3 Creating a Table
Create a table of foods for a diet called diet_plan. The columns are: food_name (which should be a VARCHAR(20)) calories (as INT) food_group (1 = dairy group, 2 = meat group, 3 = fruits and vegetables, 4 = bread group, 5 = misc, which is an INT)

In [28]:
%%sql
CREATE TABLE diet_plan (
food_name VARCHAR(20),
calories INT,
food_group INT);

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) table diet_plan already exists
[SQL: CREATE TABLE diet_plan (
food_name VARCHAR(20),
calories INT,
food_group INT);]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### Creating a Table to Store Encryption Keys
Create a table named Cipher_keys to store encryption keys for the data center model. The table should have the following data: Automatically generated integer primary key (id) The name of the key up to a length of 32 (required, name) Multi-line text field for the key (cipher_key)

In [29]:
%%sql
CREATE TABLE Cipher_keys (id bigserial primary key,
name varchar(32) not null,
cipher_key text);

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) table Cipher_keys already exists
[SQL: CREATE TABLE Cipher_keys (id bigserial primary key,
name varchar(32) not null,
cipher_key text);]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.5.5 Create Table
Create a table named uc_donutcustomers represented in the following Physical Schema by using the CREATE TABLE command. Figure A Set the CustomerAddress column to required and the CustomerPhone default value to 555-555-5555.

In [30]:
%%sql
CREATE TABLE uc_donutcustomers (
CustomerID BIGSERIAL NOT NULL PRIMARY KEY,
CustomerAddress TEXT NOT NULL,
CustomerPhone VARCHAR(30) DEFAULT '555-555-5555');

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) table uc_donutcustomers already exists
[SQL: CREATE TABLE uc_donutcustomers (
CustomerID BIGSERIAL NOT NULL PRIMARY KEY,
CustomerAddress TEXT NOT NULL,
CustomerPhone VARCHAR(30) DEFAULT '555-555-5555');]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.5.6 Display Table and Table Structure
Use the \d [tablename] command to display the following table structures:

In [31]:
%%sql
CREATE TABLE ucertifydb.Customer(
CustomerID              BIGSERIAL NOT NULL PRIMARY KEY,
FirstName                VARCHAR(50) NOT NULL,
LastName                VARCHAR(50) NOT NULL,
Street                        VARCHAR(50) NOT NULL,
Apt                            VARCHAR(50) NOT NULL,
City                            VARCHAR(50) NOT NULL,
State                          VARCHAR(50) NOT NULL,
Zip                            VARCHAR(11) NOT NULL,
HomePhone            VARCHAR(50) NULL,
MobilePhone          VARCHAR(50) NULL,
OtherPhone            VARCHAR(50) NULL,
);

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) unknown database ucertifydb
[SQL: CREATE TABLE ucertifydb.Customer( CustomerID              BIGSERIAL NOT NULL PRIMARY KEY,
FirstName                VARCHAR(50) NOT NULL,
LastName                VARCHAR(50) NOT NULL,
Street                        VARCHAR(50) NOT NULL,
Apt                            VARCHAR(50) NOT NULL,
City                            VARCHAR(50) NOT NULL,
State                          VARCHAR(50) NOT NULL,
Zip                            VARCHAR(11) NOT NULL,
HomePhone            VARCHAR(50) NULL,
MobilePhone          VARCHAR(50) NULL,
OtherPhone            VARCHAR(50) NULL,
);]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [32]:
%%sql
CREATE TABLE ucertifydb.Donut(
DonutID                    BIGSERIAL NOT NULL PRIMARY KEY,
DonutName            VARCHAR(30) NOT NULL,
DonutDescription  VARCHAR(30) NOT NULL,
DonutPrice              DECIMAL(8, 2) NOT NULL,
DonutPhotoID        VARCHAR(80) NOT NULL,
);

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) unknown database ucertifydb
[SQL: CREATE TABLE ucertifydb.Donut( DonutID                    BIGSERIAL NOT NULL PRIMARY KEY,
DonutName            VARCHAR(30) NOT NULL,
DonutDescription  VARCHAR(30) NOT NULL,
DonutPrice              DECIMAL(8, 2) NOT NULL,
DonutPhotoID        VARCHAR(80) NOT NULL,
);]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [33]:
%%sql
CREATE TABLE ucertifydb.CustomerDonutOrder (
DonutOrderID                              BIGSERIAL NOT NULL PRIMARY KEY,
CustomerID                                  INT NOT NULL,
DonutID                                        INT NOT NULL,
DonutOrderTimestamp              VARCHAR(30) NOT NULL,
OrderQty                                      INT NULL,
SpecialNotes                                VARCHAR(100) NULL,
FOREIGN KEY (CustomerID)      REFERENCES Customer (CustomerID),
FOREIGN KEY (DonutID)            REFERENCES Donut(DonutID),
);

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) unknown database ucertifydb
[SQL: CREATE TABLE ucertifydb.CustomerDonutOrder (
DonutOrderID                              BIGSERIAL NOT NULL PRIMARY KEY,
CustomerID                                  INT NOT NULL,
DonutID                                        INT NOT NULL,
DonutOrderTimestamp              VARCHAR(30) NOT NULL,
OrderQty                                      INT NULL,
SpecialNotes                                VARCHAR(100) NULL,
FOREIGN KEY (CustomerID)      REFERENCES Customer (CustomerID),
FOREIGN KEY (DonutID)            REFERENCES Donut(DonutID),
);]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [34]:
%%sql
\d Customer;
\d Donut;
\d CustomerDonutOrder;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) unrecognized token: "\"
[SQL: \d Customer;]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.5.7 Creating a Table Question 13
Create a table of sales for a diamond retail company called diamond_sales. The columns are: buyer_name (as VARCHAR(100)) sales_price (as NUMERIC(8,2)) cut_quality (1 = fair, 2 = good, 3 = very good, 4 = premium, 5 = ideal) purchase_date (as DATE)

In [35]:
%%sql
CREATE TABLE diamond_sales (
buyer_name varchar(100),
sales_price numeric(8, 2), 
cut_quality int,
purchase_date date
);

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) table diamond_sales already exists
[SQL: CREATE TABLE diamond_sales (
buyer_name varchar(100),
sales_price numeric(8, 2),
cut_quality int,
purchase_date date
);]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.5.8 Creating a Table to Store Login Information Question 14 : 
Create a table named log_ins to store user login information for a website. The table should have the following data: An automatically generated integer primary key (id) A multi-line text field for the IP address of the user (required, ip_address) A timestamp of when the user logged in (log_time)

In [36]:
%%sql
CREATE TABLE log_ins (
id BIGSERIAL PRIMARY KEY,
ip_address TEXT NOT NULL,
log_time TIMESTAMP);

SELECT * 
FROM garage 
WHERE make =  'Ferrari';

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) table log_ins already exists
[SQL: CREATE TABLE log_ins (
id BIGSERIAL PRIMARY KEY,
ip_address TEXT NOT NULL,
log_time TIMESTAMP);]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.5.10 Retrieving Specific Column Data from a Table

In [37]:
%%sql

SELECT company, monthly_fee 
FROM Services;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: Services
[SQL: SELECT company, monthly_fee FROM Services;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [38]:
%%sql

SELECT * 
FROM Artists 
WHERE Rating = 2;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: Artists
[SQL: SELECT * FROM Artists
WHERE Rating = 2;]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.6.1 Update Data in a Table

In [39]:
%%sql
UPDAEe uc_pizzaorder
SET OrderQty = 10
WHERE PizzaOrderID = 1;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) near "UPDAEe": syntax error
[SQL: UPDAEe uc_pizzaorder SET OrderQty = 10
WHERE PizzaOrderID = 1;]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.6.2 Adding New Data in a Table

In [40]:
%%sql

INSERT INTO garage 
VALUES ('Chevrolet', 'Camaro', 1971);

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: garage
[SQL: INSERT INTO garage VALUES ('Chevrolet', 'Camaro', 1971);]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.6.3 Copying Data from One Table to Another Table

In [41]:
%%sql

INSERT INTO for_sale(make, model, year) (
    SELECT * 
    FROM garage
    WHERE (make = 'Alfa Romeo'));

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) near "(": syntax error
[SQL: INSERT INTO for_sale(make, model, year) (
    SELECT *
    FROM garage
    WHERE (make = 'Alfa Romeo'));]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.6.4 Updating Data in a Table

In [42]:
%%sql

UPDATE for_sale
SET price = 50000;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: for_sale
[SQL: UPDATE for_sale SET price = 50000;]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.6.5 Updating Specific Data in a Table

In [43]:
%%sql
UPDATE for_sale
SET price = 40000
WHERE model = 'Camaro';

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: for_sale
[SQL: UPDATE for_sale SET price = 40000
WHERE model = 'Camaro';]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.6.6 Adding Data in the Table
Insert an order for "Mary Wills" for 3 widgets at a total of $33.33.

In [44]:
%%sql 
INSERT INTO widgets 
VALUES (3, 'Mary Willis', 33.33);

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: widgets
[SQL: INSERT INTO widgets VALUES (3, 'Mary Willis', 33.33);]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.6.7 Update Data in a Table 
Question 26 : Update TakeOut as Y in the MenuItems table where the Cost is more than 9.95.

In [45]:
%%sql

UPDATE MenuItems
SET TakeOut = 'Y'
WHERE Cost > 9.95;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: MenuItems
[SQL: UPDATE MenuItems SET TakeOut = 'Y'
WHERE Cost > 9.95;]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.6.8 Adding Data in the Table

In [46]:
%%sql

INSERT INTO Restaurants
(Name, Description, RestaurantType) VALUES (E'Sarah\'s Salad Shack', 'Fresh salads made to order', 3);

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) near "'Sarah\'": syntax error
[SQL: INSERT INTO Restaurants (Name, Description, RestaurantType) VALUES (E'Sarah\'s Salad Shack', 'Fresh salads made to order', 3);]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### 2.6.9 Copying Data from One Table to Another Table
The Pizza table structure is the same as the uc_pizza table. Copy the pizza with PizzaID = 1 from the uc_pizza table to the Pizza table.

In [ ]:
%%sql

INSERT INTO Pizza(PizzaID, PizzaName, PizzaDescription, PizzaPrice, PizzaPhotoID)
(SELECT * FROM uc_pizza WHERE PizzaID = 1)